const lang = {
    byChar: {
        ا: 'ܐ', إ: 'ܐ', أ: 'ܐ', آ: 'ܐ', ب: 'ܒ', ت: 'ܬ', ث: 'ܬ̥',
        ج: 'ܓ', ح: 'ܚ', خ: 'ܟ̥', د: 'ܕ', ذ: 'ܕ̊',
        ر: 'ܪ', ز: 'ܙ', س: 'ܣ', ش: 'ܫ', ص: 'ܨ', ض: 'ܨ̊', ط: 'ܛ', ظ: 'ܜ',
        ع: 'ܥ', غ: 'ܓ̥', ف: 'ܦ', ق: 'ܩ', ك: 'ܟ', ل: 'ܠ', م: 'ܡ', ن: 'ܢ', ه: 'ܗ', و: 'ܘ',
        ي: 'ܝ', ى: 'ܝ̱', ؤ: 'ܘ', ئ: 'ܐ', ء: 'ܐ', ة: 'ܗ̈',
        'َ': 'ܰ',
        'ُ': 'ܳ',
        'ِ': 'ܶ',
    },
    byCombo: {},
    cleanUp: {
        'ْ': '',
    },
};
export default lang;
//# sourceMappingURL=araToSyr.js.map